ELPasEDT/src/Reports/ОтчетПоОборудованию/ОтчетПоОборудованию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоОборудованию</name>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
</mdclass:Report>

ELPasEDT/src/Catalogs/ВидыОборудования/ВидыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОборудования</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>КодSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаДляИзменения</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <comment>Категория вида оборудования</comment>
    <type>
      <types>CatalogRef.КатегорииВидовОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыДляВидаОборудования</name>
    <attributes>
      <name>Уникален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоДопРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязателенДляЗаполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтборПриВыборе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображатьПриСоздании</name>
      <comment>Истина - реквизит отображается в форме помощника ввода нового элемента номенклатуры, Ложь - не отображается</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступностьУникален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступностьОбязателенДляЗаполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступностьОтображатьПриСоздании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыПаспорта</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>CatalogRef.ГруппыКолонокПаспорта</types>
        <types>ChartOfCharacteristicTypesRef.РеквизитыПаспортовОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиОценкиСостоянияОборудования</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПоказателиОценкиСостоянияОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КритерииОценкиСостоянияОборудования</name>
    <attributes>
      <name>ОценкаСостояния</name>
      <type>
        <types>EnumRef.ОценкиСостоянияОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммарныйВесовойКэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/Reports/ОтчетПоОборудованию/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ВидОборудованияПриИзменении(Элемент)
	
	//Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы[0].Элементы.[0]
	//Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы[0].Элементы[0].Поле
	
	ЗаполнитьВыбранныеПоля();
	УстановитьОбновитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеРеквизиты(Команда)
	
	Для Каждого ТекСотрока Из ВыбранныеПооля Цикл
		ТекСотрока.Выбор = Истина;
		ОбновитьДобавитьПолеОтчета(ТекСотрока.Реквизит, ТекСотрока.Выбор);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыборВсехРеквизитов(Команда)
	
	Для Каждого ТекСотрока Из ВыбранныеПооля Цикл
		ТекСотрока.Выбор = Ложь;
		ОбновитьДобавитьПолеОтчета(ТекСотрока.Реквизит, ТекСотрока.Выбор);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьЗаголовокРеквизита(РеквизитНаименование, Заголовок, ЕдиницаИзмеренияПредставление = "")
	
	ЗаголовокРеквизита = РеквизитНаименование;
	
	Если Не ПустаяСтрока(Заголовок) Тогда
		ЗаголовокРеквизита = Заголовок;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ЕдиницаИзмеренияПредставление) Тогда
		ЗаголовокРеквизита = ЗаголовокРеквизита + ", " + ЕдиницаИзмеренияПредставление;
	КонецЕсли;
	
	Возврат ЗаголовокРеквизита;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВыбранныеПоля()
	
	///////////////////////////////////////////////////////////////////////////////
	// Очистим настройки компоновщика
	
	ВыбранныеПооля.Очистить();
	
	ФиксированныеПоля = Новый Массив;
	ФиксированныеПоля.Добавить(Новый ПолеКомпоновкиДанных("СистемныеПоля.НомерПоПорядку"));
	ФиксированныеПоля.Добавить(Новый ПолеКомпоновкиДанных("Оборудование"));
	
	КоличПолей = Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Количество();
	Для Инд = 1 По КоличПолей Цикл
		ОбрИнд = КоличПолей - Инд;
		Элемент = Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы[ОбрИнд];
		Если ФиксированныеПоля.Найти(Элемент.Поле) = Неопределено Тогда
			Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	///////////////////////////////////////////////////////////////////////////////
	// Заполн7им настройки компоновщика
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыОборудованияРеквизитыПаспорта.Реквизит КАК Реквизит,
	|	ВидыОборудованияРеквизитыПаспорта.Заголовок КАК Заголовок,
	|	ВидыОборудованияРеквизитыПаспорта.Реквизит.ЕдиницаИзмерения КАК РеквизитЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(ВидыОборудованияРеквизитыПаспорта.Реквизит) КАК РеквизитПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВидыОборудованияРеквизитыПаспорта.Реквизит.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление
	|ИЗ
	|	Справочник.ВидыОборудования.РеквизитыПаспорта КАК ВидыОборудованияРеквизитыПаспорта
	|ГДЕ
	|	ВидыОборудованияРеквизитыПаспорта.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Отчет.ВидОборудования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТипРеквизита = ТипЗнч(Выборка.Реквизит);
		
		Если ТипРеквизита = Тип("ПланВидовХарактеристикСсылка.РеквизитыПаспортовОборудования") Тогда
			НовСтр = ВыбранныеПооля.Добавить();
			НовСтр.Выбор = Истина;
			НовСтр.Реквизит = Выборка.Реквизит;
			ОбновитьДобавитьПолеОтчета(Выборка.Реквизит);
		ИначеЕсли ТипРеквизита = Тип("СправочникСсылка.ГруппыКолонокПаспорта") Тогда
			Для Каждого Стр Из Выборка.Реквизит.РеквизитыГруппы Цикл
				НовСтр = ВыбранныеПооля.Добавить();
				НовСтр.Выбор = Истина;
				НовСтр.Реквизит = Стр.Реквизит;
				ОбновитьДобавитьПолеОтчета(Стр.Реквизит);
			КонецЦикла;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДобавитьПолеОтчета(Реквизит, Выбор = Истина)
	
	ПутьКДанным = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Оборудование.[%1]", Реквизит);
	Поле = Новый ПолеКомпоновкиДанных(ПутьКДанным);
	
	РеквизитОбработан = Ложь;
	
	Для Каждого Элемент Из Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
		Если Элемент.Поле = Поле Тогда
			Элемент.Использование = Выбор;
			РеквизитОбработан = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не РеквизитОбработан Тогда
		Элемент = Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		Элемент.Поле = Поле;
		Элемент.Использование = Выбор;
		Элемент.Заголовок = Реквизит;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПооляВыборПриИзменении(Элемент)
	
	ТекСотрока = Элементы.ВыбранныеПооля.ТекущиеДанные;
	ОбновитьДобавитьПолеОтчета(ТекСотрока.Реквизит, ТекСотрока.Выбор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновитьОтбор()
	
	///////////////////////////////////////////////////////////////////////////////
	// Очистим отбор
	
	Поле          = Новый ПолеКомпоновкиДанных("Оборудование.ВидОборудования");
	ЭлементОтбора = Неопределено;
	
	КоличЭлементовОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество();
	Для Инд = 1 По КоличЭлементовОтбора Цикл
		
		ОбрИнд = КоличЭлементовОтбора - Инд;
		Элемент = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[ОбрИнд];

		Если Элемент.ЛевоеЗначение = Поле Тогда
			ЭлементОтбора = Элемент;
		Иначе
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	///////////////////////////////////////////////////////////////////////////////
	// Основной отбор - по виду оборудования
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Поле;
	КонецЕсли;
	
	ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение   = Отчет.ВидОборудования;
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	
	///////////////////////////////////////////////////////////////////////////////
	// Дополнительный отбор по подразделению
	
	Поле          = Новый ПолеКомпоновкиДанных("Оборудование.Подразделение");
	ЭлементОтбора = Неопределено;
	
	Для Каждого Элемент Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = Поле Тогда
			ЭлементОтбора = Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение    = Поле;
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование    = Ложь;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////
	// Дополнительные отборы по значениям реквизитов паспорта
	
	ИсклПоле = Новый ПолеКомпоновкиДанных("СистемныеПоля.НомерПоПорядку");
	
	Для Каждого Элемент Из Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
		Если Элемент.Поле = ИсклПоле Тогда
			Продолжить;
		КонецЕсли;
		ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Элемент.Поле;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Ложь;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	КонецЦикла;
	
КонецПроцедуры
